from random import choice

# 1)
suit1 = ['Бубны', 'Пики', 'Черви', 'Крести']

loc1 = []
iter_list = iter(loc1)

for count in suit1:
    for i in range(1, 14):
        loc1.append([i, count])
        print(iter_list.__next__())

# Я попробовал сделать через enumerate, но код был слишком громосткий и не особо отличался от прошлого


# 2)


loc2 = []
def random_suit(cards):
    while cards:
        rand_card = choice(cards)
        loc2.append(rand_card)
        loc1.remove(rand_card)
        if len(loc2) == 52:
            return loc2

random_set = random_suit(loc1)

for i in random_set:
    print(i, end=' --> ')


#stdout:
# [1, 'Бубны']
# [2, 'Бубны']
# [3, 'Бубны']
# [4, 'Бубны']
# [5, 'Бубны']
# [6, 'Бубны']
# [7, 'Бубны']
# [8, 'Бубны']
# [9, 'Бубны']
# [10, 'Бубны']
# [11, 'Бубны']
# [12, 'Бубны']
# [13, 'Бубны']
# [1, 'Пики']
# [2, 'Пики']
# [3, 'Пики']
# [4, 'Пики']
# [5, 'Пики']
# [6, 'Пики']
# [7, 'Пики']
# [8, 'Пики']
# [9, 'Пики']
# [10, 'Пики']
# [11, 'Пики']
# [12, 'Пики']
# [13, 'Пики']
# [1, 'Черви']
# [2, 'Черви']
# [3, 'Черви']
# [4, 'Черви']
# [5, 'Черви']
# [6, 'Черви']
# [7, 'Черви']
# [8, 'Черви']
# [9, 'Черви']
# [10, 'Черви']
# [11, 'Черви']
# [12, 'Черви']
# [13, 'Черви']
# [1, 'Крести']
# [2, 'Крести']
# [3, 'Крести']
# [4, 'Крести']
# [5, 'Крести']
# [6, 'Крести']
# [7, 'Крести']
# [8, 'Крести']
# [9, 'Крести']
# [10, 'Крести']
# [11, 'Крести']
# [12, 'Крести']
# [13, 'Крести']
# [12, 'Крести'] --> [13, 'Пики'] --> [5, 'Пики'] --> [10, 'Крести'] --> [12, 'Пики'] --> [13, 'Черви'] --> [5, 'Крести'] --> [1, 'Черви'] --> [7, 'Бубны'] --> [6, 'Черви'] --> [11, 'Черви'] --> [13, 'Бубны'] --> [1, 'Бубны'] --> [6, 'Пики'] --> [6, 'Бубны'] --> [6, 'Крести'] --> [8, 'Бубны'] --> [4, 'Пики'] --> [13, 'Крести'] --> [3, 'Черви'] --> [11, 'Крести'] --> [3, 'Пики'] --> [3, 'Крести'] --> [7, 'Крести'] --> [1, 'Пики'] --> [8, 'Крести'] --> [7, 'Пики'] --> [11, 'Бубны'] --> [8, 'Пики'] --> [2, 'Пики'] --> [2, 'Черви'] --> [10, 'Черви'] --> [9, 'Черви'] --> [10, 'Пики'] --> [3, 'Бубны'] --> [12, 'Бубны'] --> [5, 'Бубны'] --> [10, 'Бубны'] --> [4, 'Черви'] --> [5, 'Черви'] --> [2, 'Крести'] --> [11, 'Пики'] --> [1, 'Крести'] --> [4, 'Бубны'] --> [9, 'Бубны'] --> [7, 'Черви'] --> [4, 'Крести'] --> [9, 'Крести'] --> [8, 'Черви'] --> [2, 'Бубны'] --> [9, 'Пики'] --> [12, 'Черви'] -->